citicorp_cfd/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         3000;
deltaT          1;

writeControl    timeStep;
writeInterval   500;
purgeWrite      3;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    forces
    {
        type            forces;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   100;
        patches         (citicorp_tower citicorp_stilts);
        rho             rhoInf;
        rhoInf          1.225;
        CofR            (0 0 139);
    }

    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }

    fieldMinMax
    {
        type            fieldMinMax;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        writeInterval   100;
        fields          (U p k omega);
    }

    residuals
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        writeControl    timeStep;
        writeInterval   1;
        fields          (p U k omega);
    }
}

// Convergence control
residualControl
{
    p               1e-4;
    U               1e-5;
    k               1e-5;
    omega           1e-5;
}
