citicorp_cfd/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Domain: 720m x 720m x 600m
// Building centered at origin, wind in +x direction
// ~200m upstream, ~520m downstream

scale   1;

xMin   -200;
xMax    520;
yMin   -360;
yMax    360;
zMin      0;
zMax    600;

// Base cell size ~20m
nX      36;    // 720/20
nY      36;    // 720/20
nZ      30;    // 600/20

vertices
(
    ($xMin $yMin $zMin)   // 0
    ($xMax $yMin $zMin)   // 1
    ($xMax $yMax $zMin)   // 2
    ($xMin $yMax $zMin)   // 3
    ($xMin $yMin $zMax)   // 4
    ($xMax $yMin $zMax)   // 5
    ($xMax $yMax $zMax)   // 6
    ($xMin $yMax $zMax)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    ($nX $nY $nZ)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    sides
    {
        type symmetry;
        faces
        (
            (0 1 5 4)   // yMin
            (3 7 6 2)   // yMax
        );
    }
);
