citicorp_cfd/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

// Kinematic viscosity of air at ~20°C, sea level
nu              [0 2 -1 0 0 0 0] 1.5e-05;
