citicorp_cfd/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (44.7 0 0);

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        flowDir         (1 0 0);
        zDir            (0 0 1);
        Uref            44.7;
        Zref            10;
        z0              uniform 0.1;
        d               uniform 0;
        value           uniform (44.7 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (44.7 0 0);
    }

    ground
    {
        type            noSlip;
    }

    top
    {
        type            slip;
    }

    sides
    {
        type            symmetry;
    }

    citicorp_tower
    {
        type            noSlip;
    }

    citicorp_stilts
    {
        type            noSlip;
    }

    surroundings
    {
        type            noSlip;
    }
}
