citicorp_cfd/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    ground
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    top
    {
        type            slip;
    }

    sides
    {
        type            symmetry;
    }

    citicorp_tower
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    citicorp_stilts
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    surroundings
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
}
